; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_2 ?v5 - type_2 ?v3 - type_1)
 	      (pred_3 ?v1 - object ?v3 - type_1)
	      (pred_1 ?v5 - type_2 ?v6 - type_3)
	      (pred_4 ?v5 - type_2 ?v1 - object ?v6 - type_3))

   (:action op_2
       :parameters  (?v5 - type_2 ?v7 ?v2 - type_1)
       :precondition (and  (pred_2 ?v5 ?v7))
       :effect (and  (pred_2 ?v5 ?v2)
		     (not (pred_2 ?v5 ?v7))))

   (:action op_1
       :parameters (?v5 - type_2 ?v8 - object ?v4 - type_1 ?v6 - type_3)
       :precondition  (and  (pred_3 ?v8 ?v4) (pred_2 ?v5 ?v4) (pred_1 ?v5 ?v6))
       :effect (and (pred_4 ?v5 ?v8 ?v6)
		    (not (pred_3 ?v8 ?v4)) 
		    (not (pred_1 ?v5 ?v6))))

   (:action op_3
       :parameters (?v5 - type_2 ?v8 - object ?v4 - type_1 ?v6 - type_3)
       :precondition  (and  (pred_4 ?v5 ?v8 ?v6) (pred_2 ?v5 ?v4))
       :effect (and (pred_3 ?v8 ?v4)
		    (pred_1 ?v5 ?v6)
		    (not (pred_4 ?v5 ?v8 ?v6)))))

; problem
(define (problem gripper-2-3-2)
(:domain gripper-strips)
(:objects obj_11 obj_06 - type_2
obj_05 obj_04 obj_01 obj_03 - type_3
obj_10 obj_08 obj_02 - type_1
obj_07 obj_09 - object)
(:init
(pred_2 obj_11 obj_08)
(pred_1 obj_11 obj_05)
(pred_1 obj_11 obj_04)
(pred_2 obj_06 obj_02)
(pred_1 obj_06 obj_01)
(pred_1 obj_06 obj_03)
(pred_3 obj_07 obj_08)
(pred_3 obj_09 obj_08)
)
(:goal
(and
(pred_3 obj_07 obj_02)
(pred_3 obj_09 obj_08)
)
)

(:constraints
  (always (not (pred_2 obj_11 obj_02)))
)
)

; plan
1. (op_2 obj_06 obj_02 obj_08)
   deleted: (pred_2 obj_06 obj_02)
   added: (pred_2 obj_06 obj_08)
   goals met: 1 of 2
2. (op_1 obj_06 obj_07 obj_08 obj_03)
   deleted: (pred_3 obj_07 obj_08) (pred_1 obj_06 obj_03)
   added: (pred_4 obj_06 obj_07 obj_03)
   goals met: 1 of 2
3. (op_2 obj_06 obj_08 obj_02)
   deleted: (pred_2 obj_06 obj_08)
   added: (pred_2 obj_06 obj_02)
   goals met: 1 of 2
4. (op_3 obj_06 obj_07 obj_02 obj_03)
   deleted: (pred_4 obj_06 obj_07 obj_03)
   added: (pred_3 obj_07 obj_02) (pred_1 obj_06 obj_03)
   goals met: 2 of 2
